/* *******************************************************************************************
// Author:      biu~
// Last Date:   2018/03/22
// 基于定时器的时钟；
/* ******************************************************************************************* */

#include "Timer_Clock.H"

char Hour = 8,
     Min = 25,
     Sec = 30;      //时分秒；
u8 Chronograph;    //计时计次；

#ifdef USE_SEG_DIS
u8 TimeSEG[8];
#endif
/* *******************************************************************************************
// 时间时钟初始化，包括时分秒的初始化及对 计时计次 参数的计算；
/* ******************************************************************************************* */
void Timer_Clock_Init()
{
    Hour = 21;      //此处时间调节可考虑结合E2PROM；
    Min = 55;
    Sec = 59;
    Chronograph = _1S / TIME_BASE_1ST;
#ifdef USE_SEG_DIS
    Transf_TimeSEG();
#endif
}

/* *******************************************************************************************
// 时间时钟计时函数；
/* ******************************************************************************************* */
void Timer_Clock()
{
    static u8 cP;
    if (++ cP >= Chronograph)
    {
        cP = 0;
        if (++ Sec >= 60)
        {
//            TestCode();
            Sec = 0;
            if (++ Min >= 60)
            {
                Min = 0;
                if (++ Hour >= 24)
                {
                    Hour = 0;
                }
            }
        }
    }
}
/* *******************************************************************************************
// 时间时钟计时函数；
/* ******************************************************************************************* */
#ifdef USE_SEG_DIS
void Transf_TimeSEG()
{
    TimeSEG[0] = Seg_7[Hour / 10];  
    TimeSEG[1] = Seg_7[Hour % 10];  
    TimeSEG[3] = Seg_7[Min / 10];  
    TimeSEG[4] = Seg_7[Min % 10];  
    TimeSEG[6] = Seg_7[Sec / 10];  
    TimeSEG[7] = Seg_7[Sec % 10];  
    if (Sec % 2)
    {
        TimeSEG[2] = SEG_NEGATIVE_SIGN;  
        TimeSEG[5] = SEG_NEGATIVE_SIGN;  
    }
    else
    {
        TimeSEG[2] = 0xFF;  
        TimeSEG[5] = 0xFF;  
    }
}
#endif
